configuration/src/Catalogs/DigitalSignatureAndEncryptionApplications/DigitalSignatureAndEncryptionApplications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DigitalSignatureAndEncryptionApplications</name>
  <attributes>
    <name>ApplicationName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApplicationType</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SignAlgorithm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HashAlgorithm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EncryptAlgorithm</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsBuiltInCryptoProvider</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UsageMode</name>
    <type>
      <types>EnumRef.DigitalSignatureAppUsageModes</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Enums/DigitalSignatureAppUsageModes/DigitalSignatureAppUsageModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DigitalSignatureAppUsageModes</name>
  <enumValues>
    <name>SetupDone</name>
  </enumValues>
  <enumValues>
    <name>Automatically</name>
  </enumValues>
  <enumValues>
    <name>NotUsed</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/DigitalSignatureAndEncryptionApplications/Forms/AutoDeterminedApp/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	IsSubordinateDIBNode = Common.IsSubordinateDIBNode();
	HasRightsToAddApp = AccessRight("Insert", Metadata.Catalogs.DigitalSignatureAndEncryptionApplications);
	
	If ValueIsFilled(Parameters.Application) Then
		FillPropertyValues(ThisObject, Parameters.Application);
		
		Title = Parameters.Application.Presentation;
		
		ApplicationPath = Parameters.Application.PathToAppAuto;
		Items.ApplicationPath.Visible = ValueIsFilled(ApplicationPath);
		
		PathToAppAtServer = Parameters.Application.PathToAppAuto;
		Items.PathToAppAtServer.Visible = ValueIsFilled(PathToAppAtServer);
	EndIf;

EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Change(Command)

	AddToCatalog(PredefinedValue(
		"Enum.DigitalSignatureAppUsageModes.SetupDone"));

EndProcedure

&AtClient
Procedure Disable(Command)

	AddToCatalog(PredefinedValue(
		"Enum.DigitalSignatureAppUsageModes.NotUsed"));

EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure AddToCatalog(UsageMode)
	
	If Not HasRightsToAddApp Then

		ShowMessageBox( , NStr("en = 'To change the application settings, contact the administrator.';"));

	ElsIf IsSubordinateDIBNode Then

		ShowMessageBox( , NStr("en = 'To change the application settings, add it to the catalog.
					 |Add the application in the infobase master node.';"));

	Else
	
		FormParameters = New Structure("Application, UsageMode", Parameters.Application, UsageMode);
		OpenForm("Catalog.DigitalSignatureAndEncryptionApplications.ObjectForm", FormParameters,,,,,,
			FormWindowOpeningMode.Independent);
		Close();
		
	EndIf;
	
EndProcedure

#EndRegion
